nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3 ]] 
  - [-1, 1, Conv, [64, 3 ]] 
  - [-1, 1, Conv, [64, 6, 2, 2]] # 128, 128
  - [-1, 1, Conv, [64, 3, 2]]  # 64, 64
  
  - [-1, 1, GhostConv, [128, 3, 2]] #  32, 32
  - [-1, 1, GhostConv, [256, 3, 4]] #  16, 16
  - [-1, 9, C2f, [128]] # 6 
  - [-1, 1, GhostConv, [256, 3, 2]] # 7  8 8

  - [-1, 9, C2f, [256]] # 8
  - [-1, 1, GhostConv, [512, 3, 2]] # 9  4, 4

  - [-1, 9, C2f, [512]] # 10 # schimbat de 256 in 512 !!!!!
  - [-1, 1, GhostConv, [1024, 3, 2]] #  11  2, 2

  - [-1, 9, C2f, [1024]] # 12
  - [-1, 1, SPPF,[1024, 5]] # 13
  
# 13 straturi cu indexare 0
head:
  - [-1, 1, GhostConv, [512, 1, 1]]                # reduce channels
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # upsample P5 -> P4 size
  - [[-1, 10], 1, Concat, [1]]                     # concat with backbone P4
  - [-1, 3, C3Ghost, [512, True]] # 17                # fused P4_td  (P4 top-down)

  - [-1, 1, GhostConv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # upsample P4_td -> P3 size
  - [[-1, 8], 1, Concat, [1]]                      # concat with backbone P3
  - [-1, 3, C3Ghost, [256, True]]  # 21            # fused P3_td  (P3 top-down)

  - [-1, 1, GhostConv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                
  - [[-1, 6], 1, Concat, [1]]                     
  - [-1, 3, C3Ghost, [256, True]]  # 24            

  - [-1, 1, GhostConv, [256, 3, 2]]                
  - [[-1, 8], 1, Concat, [1]]                     
  - [-1, 3, C3Ghost, [512, True]]  # 27           

  - [-1, 1, GhostConv, [512, 3, 2]]                
  - [[-1, 10], 1, Concat, [1]]                     
  - [-1, 3, C3Ghost, [1024, True]]  # 30 

  - [[24, 27, 30], 1, Detect, [nc]] 